import openpyxl
from openpyxl.styles import Alignment, Font
from openpyxl.utils import get_column_letter

data = [
    {"Таб. номер": "0002", "Фамилия": "Петров П.П.", "Отдел": "Бухгалтерия", "Сумма по окладу, руб.": 3913.04, "Сумма по надбавкам, руб.": 2608.7, "НДФЛ, %": 13},
    {"Таб. номер": "0005", "Фамилия": "Васин В.В.", "Отдел": "Бухгалтерия", "Сумма по окладу, руб.": 5934.78, "Сумма по надбавкам, руб.": 913.04, "НДФЛ, %": 13},
    {"Итог": "Бухгалтерия"},
    {"Таб. номер": "0003", "Фамилия": "Иванов И.И.", "Отдел": "Отдел кадров", "Сумма по окладу, руб.": 6000.00, "Сумма по надбавкам, руб.": 4000.00, "НДФЛ, %": 13},
    {"Таб. номер": "0006", "Фамилия": "Сидоров С.С.", "Отдел": "Отдел кадров", "Сумма по окладу, руб.": 5000.00, "Сумма по надбавкам, руб.": 4500.00, "НДФЛ, %": 13},
    {"Таб. номер": "0008", "Фамилия": "Петров Л.И.", "Отдел": "Отдел кадров", "Сумма по окладу, руб.": 4074.07, "Сумма по надбавкам, руб.": 2444.44, "НДФЛ, %": 13},
    {"Таб. номер": "0007", "Фамилия": "Волков В.В.", "Отдел": "Отдел кадров", "Сумма по окладу, руб.": 1434.78, "Сумма по надбавкам, руб.": 1434.78, "НДФЛ, %": 13},
    {"Итог": "Отдел кадров"},
    {"Таб. номер": "0004", "Фамилия": "Мишин М.М.", "Отдел": "Столовая", "Сумма по окладу, руб.": 5500.00, "Сумма по надбавкам, руб.": 3500.00, "Сумма зарплаты, руб.": 7800000, "НДФЛ, %": 13},
    {"Итог": "Столовая"},
    {"Общий итог": "Общий итог"}
]

wb = openpyxl.Workbook()
sheet = wb.active

headers = ["Таб. номер", "Фамилия", "Отдел", "Сумма по окладу, руб.", "Сумма по надбавкам, руб.", "Сумма зарплаты, руб.", "НДФЛ, %", "Сумма НДФЛ, руб.", "Сумма к выдаче, руб."]
sheet.append(headers)

stats = {"Сумма по окладу, руб.": [0], "Сумма по надбавкам, руб.": [0], "Сумма зарплаты, руб.": [0], "Сумма НДФЛ, руб.": [0], "Сумма к выдаче, руб.": [0]}

for row in data:
    if "Таб. номер" in row:
        row["Сумма зарплаты, руб."] = row["Сумма по окладу, руб."] + row["Сумма по надбавкам, руб."]
        row["Сумма НДФЛ, руб."] = round(row["Сумма зарплаты, руб."] * row["НДФЛ, %"] / 100, 2)
        row["Сумма к выдаче, руб."] = row["Сумма зарплаты, руб."] - row["Сумма НДФЛ, руб."]
        sheet.append([row["Таб. номер"], row["Фамилия"], row["Отдел"], row["Сумма по окладу, руб."], row["Сумма по надбавкам, руб."], row["Сумма зарплаты, руб."], row["НДФЛ, %"], row["Сумма НДФЛ, руб."], row["Сумма к выдаче, руб."]])
        for statField in stats.keys():
             stats[statField][-1] += row[statField] 
    elif "Итог" in row:
        sheet.append(["", "", row["Итог"] + "\nИтог", stats["Сумма по окладу, руб."][-1], stats["Сумма по надбавкам, руб."][-1], stats["Сумма зарплаты, руб."][-1], "", stats["Сумма НДФЛ, руб."][-1], stats["Сумма к выдаче, руб."][-1]])
        for statField in stats.keys():
            stats[statField].append(0)
    elif "Общий итог" in row:
        sheet.append(["", "", row["Общий итог"], sum(stats["Сумма по окладу, руб."]), sum(stats["Сумма по надбавкам, руб."]), sum(stats["Сумма зарплаты, руб."]), "", sum(stats["Сумма НДФЛ, руб."]), sum(stats["Сумма к выдаче, руб."])])

sheet["C4"].font = Font(bold=True)
sheet['C9'].font = Font(bold=True)
sheet['C11'].font = Font(bold=True)
sheet['C12'].font = Font(bold=True)

wb.save("table.xlsx")